import PageHeader from "@/app/components/ui/PageHeader";
import Accordion from "@/app/components/ui/Accordion";
import { faScaleUnbalancedFlip } from "@fortawesome/free-solid-svg-icons";
/**
 * RulesPage component displays the terms and conditions of using the Amiran Tajhiz website.
 * Each rule section is presented in an expandable Accordion format for better readability.
 *
 * @component
 * @returns {JSX.Element} A structured layout of legal and policy information
 */
export default function RulesPage() {
  return (
    <section className="max-w-7xl mx-auto px-4 mb-16 pt-8">
      <PageHeader title="شرایط و قوانین" icon={faScaleUnbalancedFlip} />
      <ul>
        <Accordion question="قوانین عمومی">
          <p>
            توجه داشته باشید کلیه اصول و رویه‌های امیران تجهیز منطبق با قوانین
            جمهوری اسلامی ایران، قانون تجارت الکترونیک و حمایت از حقوق مصرف
            کننده است و متعاقبا کاربر نیز موظف به رعایت قوانین مرتبط با کاربر
            است. در صورتی که در قوانین مندرج، رویه‌ها و سرویس‌های امیران تجهیز
            تغییراتی در آینده ایجاد شود، در همین صفحه منتشر می‌شود و به روز
            می‌شود و شما توافق می‌کنید که مستمر از سایت به معنی پذیرش تغییر شما
            تغییر می‌کند.
          </p>
        </Accordion>
        <Accordion question="تعریف مشتری یا کاربر">
          <p>
            مشتری یا کاربر به شخصی گفته می‌شود که با اطلاعات کاربری خود که در
            فرم ثبت‌نام درج کرده است، به ثبت سفارش یا هرگونه استفاده از خدمات
            امیران تجهیز اقدام کند.
          </p>
          <p>
            همچنین از آنجا که امیران تجهیز یک وب‌سایت خرده‌فروشی آنلاین است، طبق
            قانون تجارت الکترونیک مشتری یا مصرف کننده هر شخصی است که به منظوری
            جز تجارت یا شغل حرفه‌ای به خرید کالا یا خدمات اقدام می‌کند.
          </p>
        </Accordion>
        <Accordion question="سیاست‌های رعایت حریم شخصی">
          <p>
            امیران تجهیز به اطلاعات خصوصی افرادی که از خدمات سایت استفاده
            می‌کنند، احترام گذاشته و از آن محافظت می‌کند.
          </p>
          <p>
            امیران تجهیز متعهد است که در حد توان خود از حریم خصوصی شما محافظت
            کند و فناوری مورد نیاز برای استفاده هرچه ایمن‌تر و مطمئن‌تر شما از
            سایت را توسعه دهد. در واقع، با استفاده از سایت امیران تجهیز، شما
            رضایت خود را از این سیاست اعلام می‌کنید.
          </p>
        </Accordion>
        <Accordion question="ثبت، پردازش و ارسال سفارش">
          <p>
            روزهای کاری از شنبه تا پنجشنبه هر هفته، به استثنای تعطیلات رسمی در
            ایران، تعریف شده است و کلیه سفارش‌های ثبت شده در طول روزهای کاری و
            اولین روز پس از تعطیلات پردازش می‌شوند. امیران تجهیز به مشتریان خود
            در ۷ روز هفته و ۲۴ ساعت شبانه‌روز امکان ثبت سفارش می‌دهد.
          </p>
        </Accordion>
        <Accordion question="خسارت در هنگام حمل و نقل">
          <p>
            امیران تجهیز همواره تمام تلاش خود را می‌کند تا تمامی سفارش‌ها در
            امن‌ترین و مطمئن‌ترین حالت به دست مشتریان خود در سراسر کشور برسد. با
            توجه به بسته‌بندی ایمن و استاندارد تمامی مرسولات، تحویل به هر شرکت
            حمل و نقل معتبر به انتخاب کاربر و اعلام بارنامه مرسوله (درج در سبد
            خرید و اطلاع‌رسانی از طریق سرویس پیامک)، این بدان معناست که هرگونه
            حادثه در هنگام حمل و تحویل بر عهده شرکت حمل و نقل است و امیران تجهیز
            تنها در صورت تأیید سفارش توسط شرکت حمل و نقل و به منظور تسهیل
            پیگیری، خسارت را جبران می‌کند.
          </p>
          <p>
            آسیب های ناشی از حمل و نقل باید در عرض ۲۴ ساعت کاری پس از تحویل
            سفارش به خدمات پس از فروش امیران تجهیز اطلاع داده شود و کالای آسیب
            دیده به همراه صورتجلسه رسمی شرکت حمل کننده و کلیه متعلقات و فاکتور
            به خدمات پس از فروش امیران تجهیز ارسال شود.
          </p>
        </Accordion>
        <Accordion question="نظرات کاربران">
          <p>
            هدف از ایجاد بخش نظرات در امیران تجهیز، به اشتراک گذاشتن تجربه خرید
            و استفاده از محصولاتی است که فروخته می‌شوند. بدیهی است که بخش نظرات
            در امیران تجهیز با سایر سایت‌ها و شبکه‌های اجتماعی متفاوت است. در
            این بخش، هر کاربر مجاز است نظرات خود را در چارچوب شرایط و ضوابط سایت
            به اشتراک بگذارد و پس از بررسی و تأیید کارشناسان، نظرات او در سایت
            نمایش داده می‌شود. بدیهی است که در صورت عدم رعایت قوانین سایت در
            نظرات کاربران، آنها تأیید نشده و در نتیجه در سایت نمایش داده نخواهند
            شد. امیران تجهیز هیچ مسئولیتی در قبال صحت یا عدم صحت نظرات منتشر شده
            در این بخش ندارد. نمایش نظرات کاربران در سایت به هیچ وجه به معنای
            تأیید فنی محتوای نظر توسط امیران تجهیز نیست. بنابراین از کاربران
            محترم درخواست می‌شود که نظرات را مبنای انتخاب و تصمیم‌گیری خود قرار
            ندهند.
          </p>
        </Accordion>
      </ul>
    </section>
  );
}
